In [2]:
import pandas as pd
emp_list=[["Jesny",25,25000,"SS03"],
          ["Sariga",25,27000,"SS01"],
          ["Akhil",29,32000,"SS05"],
          ["Arathy",30,19500,"SS01"],
          ["Bijith",32,45000,"SS09"],
          ["Alfred",28,35000,"SS02"],
          ["Anupama",25,19500,"SS04"]]
df = pd.DataFrame(emp_list, columns=['Name', 'Age', 'Salary','EmployeeID'])
df1 = df.iloc[1:5]
# iloc is used to slice the index
print(df1)

     Name  Age  Salary EmployeeID
1  Sariga   25   27000       SS01
2   Akhil   29   32000       SS05
3  Arathy   30   19500       SS01
4  Bijith   32   45000       SS09

In [3]:
df1 = df.iloc[:, 0:2]
# befor the comma ie, the first space is for rows and 0:2 represent the coloumn slicing
print(df1)

      Name  Age
0    Jesny   25
1   Sariga   25
2    Akhil   29
3   Arathy   30
4   Bijith   32
5   Alfred   28
6  Anupama   25

In [5]:
value = df.iloc[4, 2]  
print("Specific Cell Value:", value)
# iat can also used to get specific value but .iat Only works for single elements.
# df.iat[2:4, 1]    Not allowed
# df.iloc[2:5, 1]   Returns a Series of ages from row 2 to 4

Specific Cell Value: 45000

In [9]:
data = df[df['Age'] > 25].iloc[:, :] 
print("\nFiltered Data based on Age > 35:\n", data)

Filtered Data based on Age > 35:
         Age  Salary EmployeeID
Name
Akhil    29   32000       SS05
Arathy   30   19500       SS01
Bijith   32   45000       SS09
Alfred   28   35000       SS02

In [11]:
emp_list=[["Jesny",25,25000,"SS03"],
          ["Sariga",25,27000,"SS01"],
          ["Akhil",29,32000,"SS05"],
          ["Arathy",30,19500,"SS01"],
          ["Bijith",32,45000,"SS09"],
          ["Alfred",28,35000,"SS02"],
          ["Anupama",25,19500,"SS04"]]
df = pd.DataFrame(emp_list, columns=['Name', 'Age', 'Salary','EmployeeID'])
df.set_index('Name', inplace=True)
# loc  cannot slice according to index it slices with the array elements
custom = df.loc['Akhil':'Alfred']
print(custom)

        Age  Salary EmployeeID
Name
Akhil    29   32000       SS05
Arathy   30   19500       SS01
Bijith   32   45000       SS09
Alfred   28   35000       SS02

In [12]:
result = df.loc['Bijith', 'Salary']
print("\nValue of the Specific Cell (Bijith, Salary):", value)

Value of the Specific Cell (Bijith, Salary): 45000

In [13]:
dataFrame = pd.DataFrame({'Name': ['Jesny', 'Lisa', 'Jennie',
                                   'Rosie', 'Jisoo', 'Nikhil'],
                          
                          'Age': [25,27,28,28,29,26],
                          
                          'Salary': [250000,1000000,800000,900000,600000,1000000],
                          
                          'JOB': ['Analyst', 'Dancer', 'Rapper', 'Singer',
                                  'Artist', 'Manager']})
display(dataFrame)

     Name  Age   Salary      JOB
0   Jesny   25   250000  Analyst
1    Lisa   27  1000000   Dancer
2  Jennie   28   800000   Rapper
3   Rosie   28   900000   Singer
4   Jisoo   29   600000   Artist
5  Nikhil   26  1000000  Manager

In [18]:
# filter dataframe
display(dataFrame.loc[(dataFrame['Salary']>=1000000) & (dataFrame['Age']< 29) & (dataFrame['JOB'].str.startswith('M')),
                    ['Name','JOB']])

     Name      JOB
5  Nikhil  Manager